# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes (adjust based on your dataset)
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone with EfficientNet and CBAM integration
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Efficient1, [40]],  # 0
    [-1, 1, CBAM, [40]],  # CBAM after first Efficient1 block
    [-1, 1, Efficient2, [112]],  # 1
    [-1, 1, CBAM, [112]],  # CBAM after Efficient2 block
    [-1, 1, Efficient3, [1280]],  # 2
    [-1, 1, SPPF, [1024, 5]],  # 3
    [-1, 1, CBAM, [1024]],  # CBAM after SPPF block
  ]

# YOLOv5 v6.0 head with CBAM integration
head:
  [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 1], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C3, [512, False]],  # 7
    [-1, 1, CBAM, [512]],  # CBAM after C3 block

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 0], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C3, [256, False]],  # 11 (P3/8-small)
    [-1, 1, CBAM, [256]],  # CBAM after C3 block

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 7], 1, Concat, [1]],  # cat head P4
    [-1, 3, C3, [512, False]],  # 14 (P4/16-medium)
    [-1, 1, CBAM, [512]],  # CBAM after C3 block

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 3], 1, Concat, [1]],  # cat head P5
    [-1, 3, C3, [1024, False]],  # 17 (P5/32-large)
    [-1, 1, CBAM, [1024]],  # CBAM after final C3 block

    [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
